//----------------------------------------------------------------------------

//RC-5 Tester - модуль поддержки LED-дисплея, заголовочный файл

//----------------------------------------------------------------------------

#ifndef DisplayH
#define DisplayH

//----------------------------- Константы: -----------------------------------

#define POINT 0x80        //децимальная точка

//-------------------------- Прототипы функций: ------------------------------

void Display_Init(void);  //инициализация дисплея
void Display_Exe(bool t); //сканирование дисплея
void Display_RC5(bool t); //вывод значений

//----------------------------------------------------------------------------

#endif
