//----------------------------------------------------------------------------

//RC-5 Tester - модуль поддержки LED-дисплея

//----------------------------------------------------------------------------

//Дисплей использует 7-сегментные LED-индикаторы с общим анодом.
//Индикаторы управляются портами микроконтроллера напрямую.
//Сегменты подключены к портам SEG_A…SEG_H, общие электроды -
//к портам SCAN1…SCAN3. Функция сканирования индикаторов Display_Scan()
//должна вызываться с периодичностью сканирования.
//Для вывода точки необходимо к 7-сегментному коду, полученному
//с помощью функции Conv(), добавить константу POINT.

//----------------------------------------------------------------------------

#include "Main.h"
#include "Display.h"
#include "RC5.h"

//----------------------------- Константы: -----------------------------------

#define DIGS 4     //количество разрядов
#define MINUS 0x10 //код символа "минус"

//Расположение сегментов на индикаторе:
//
//    -- A --
//   |       |
//   F       B
//   |       |
//    -- G --
//   |       |
//   E       C
//   |       |
//    -- D --  (H)

#define _A_ 0x01
#define _B_ 0x02
#define _C_ 0x04
#define _D_ 0x08
#define _E_ 0x10
#define _F_ 0x20
#define _G_ 0x40
#define _H_ 0x80

//----------------------------- Переменные: ----------------------------------

static char SegData[DIGS]; //массив копий сегментов индикатора

//-------------------------- Прототипы функций: ------------------------------

char Conv(char d); //преобразование кода символа в 7-сегментный код

//------------ Преобразование кода символа в 7-сегментный код: ---------------

char Conv(char d)
{
  static char __flash Font[]= //перекодировочная таблица
  {
    _A_ | _B_ | _C_ | _D_ | _E_ | _F_,       //код 00H, символ "0"
    _B_ | _C_,                               //код 01H, символ "1"
    _A_ | _B_ | _G_ | _E_ | _D_,             //код 02H, символ "2"
    _A_ | _B_ | _C_ | _D_ | _G_,             //код 03H, символ "3"
    _F_ | _G_ | _B_ | _C_ ,                  //код 04H, символ "4"
    _A_ | _F_ | _G_ | _C_ | _D_,             //код 05H, символ "5"
    _A_ | _F_ | _G_ | _C_ | _D_ | _E_,       //код 06H, символ "6"
    _A_ | _B_ | _C_,                         //код 07H, символ "7"
    _A_ | _B_ | _C_ | _D_ | _E_ | _F_ | _G_, //код 08H, символ "8"
    _A_ | _B_ | _C_ | _D_ | _F_ | _G_,       //код 09H, символ "9"
    _A_ | _B_ | _C_ | _E_ | _F_ | _G_,       //код 0AH, символ "A"
    _C_ | _D_ | _E_ | _F_ | _G_,             //код 0BH, символ "b"
    _A_ | _D_ | _E_ | _F_,                   //код 0CH, символ "C"
    _B_ | _C_ | _D_ | _E_ | _G_,             //код 0DH, символ "d"
    _A_ | _D_ | _E_ | _F_ | _G_,             //код 0EH, символ "E"
    _A_ | _E_ | _F_ | _G_,                   //код OFH, символ "F"
    _G_                                      //код 10H, символ "-"
  };
  if(d > 0x0F) d = MINUS; //символ "-", если неизвестный код
  return(Font[d]);        //7-сегментный код для символа
}

//------------------------- Инициализация дисплея: ---------------------------

void Display_Init(void)
{
  for(char i = 0; i < DIGS; i++)
    SegData[i] = Conv(MINUS);    //очистка дисплея
}

//------------------------- Сканирование дисплея: ----------------------------

void Display_Exe(bool t)
{
  static char Phase = 0;
  if(t)
  {
    //выключение всех скан-линий:
    Port_SCAN1_0;
    Port_SCAN2_0;
    Port_SCAN3_0;
    Port_SCAN4_0;
    char s = SegData[Phase];
    //включение нужных сегментов:
    (s & 0x01)? Port_SEG_A_0 : Port_SEG_A_1;
    (s & 0x02)? Port_SEG_B_0 : Port_SEG_B_1;
    (s & 0x04)? Port_SEG_C_0 : Port_SEG_C_1;
    (s & 0x08)? Port_SEG_D_0 : Port_SEG_D_1;
    (s & 0x10)? Port_SEG_E_0 : Port_SEG_E_1;
    (s & 0x20)? Port_SEG_F_0 : Port_SEG_F_1;
    (s & 0x40)? Port_SEG_G_0 : Port_SEG_G_1;
    (s & 0x80)? Port_SEG_H_0 : Port_SEG_H_1;
    //включение нужной скан-линии:
    (Phase == 0)? Port_SCAN1_1 : Port_SCAN1_0;
    (Phase == 1)? Port_SCAN2_1 : Port_SCAN2_0;
    (Phase == 2)? Port_SCAN3_1 : Port_SCAN3_0;
    (Phase == 3)? Port_SCAN4_1 : Port_SCAN4_0;
    //следующая фаза сканирования:
    if(++Phase == DIGS) Phase = 0;
  }
}

//---------------------------- Вывод значений: -------------------------------

void Display_RC5(bool t)
{
  static char sys = 0xFF;    //неиспользуемый код системы
  static char com = 0xFF;    //неиспользуемый код команды
  if(t)
  {
    char s = RC5_GetSys();   //чтение номера системы
    char c = RC5_GetCom();   //чтение номера команды
    if(s != sys || c != com) //если есть изменения, то
    {
      sys = s;               //сохранение новой системы
      com = c;               //сохранение новой команды
      //вывод старшего разряда системы:
      SegData[0] = Conv((s & 0x1F) / 16);
      //вывод младшего разряда системы и точки (управляющего бита):
      SegData[1] = Conv((s & 0x1F) % 16) + ((s & 0x20)? POINT : 0);
      //вывод старшего разряда команды:
      SegData[2] = Conv(c / 16);
      //вывод младшего разряда команды:
      SegData[3] = Conv(c % 16);
    }
  }
}

//----------------------------------------------------------------------------
