//----------------------------------------------------------------------------

//Декодер RC-5, заголовочный файл

//----------------------------------------------------------------------------

#ifndef RC5H
#define RC5H

//-------------------------- Прототипы функций: ------------------------------

void RC5_Init(void);   //инициализация модуля декодера
void RC5_Exe(bool s);  //обработка принятого кода
char RC5_GetSys(void); //чтение номера системы
char RC5_GetCom(void); //чтение кода команды

//----------------------------------------------------------------------------

#endif
